
/***************************************************************************
 *                         _______ _______ _______                         *
 *                        |  ___  |____   |  ___  |                        *
 *                        | |   |_|    / /| |   |_|                        *
 *                        | |_____    / / | |_____                         *
 *                        |_____  |  / /  |_____  |                        *
 *                         _    | | / /    _    | |                        *
 *                        | |___| |/ /____| |___| |                        *
 *                        |_______|_______|_______|                        *
 *                                                                         *
 *                            Wiimms SZS Tools                             *
 *                          https://szs.wiimm.de/                          *
 *                                                                         *
 ***************************************************************************
 *                                                                         *
 *   This file is part of the SZS project.                                 *
 *   Visit https://szs.wiimm.de/ for project details and sources.          *
 *                                                                         *
 *   Copyright (c) 2011-2022 by Dirk Clemens <wiimm@wiimm.de>              *
 *                                                                         *
 ***************************************************************************
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   See file gpl-2.0.txt or http://www.gnu.org/licenses/gpl-2.0.txt       *
 *                                                                         *
 ***************************************************************************/

// all about BMG files:
//	https://wiki.tockdom.de/index.php?title=BMG

///////////////////////////////////////////////////////////////////////////////

#ifndef SZS_LIB_STATICR_H
#define SZS_LIB_STATICR_H 1

#include "lib-std.h"

//
///////////////////////////////////////////////////////////////////////////////
///////////////			    enums			///////////////
///////////////////////////////////////////////////////////////////////////////
// [[str_mode_t]]

typedef enum str_mode_t
{
    STR_M_UNKNOWN,

    STR_M_PAL,
    STR_M_USA,
    STR_M_JAP,
    STR_M_KOR,
     STR_M__N,

    //--- zero based index support
    STR_ZBI_FIRST	= STR_M_PAL,
    STR_ZBI_N		= STR_M__N - STR_ZBI_FIRST,
}
__attribute__ ((packed)) str_mode_t;

ccp GetStrModeName ( str_mode_t mode );
extern const KeywordTab_t str_mode_keyword_tab[];

//-----------------------------------------------------------------------------
// [[str_flags_t]]

typedef enum str_flags_t
{
    STR_F_IS_DOL	= 0x01,  // 0: staticr.rel, 1: main.dol
    STR_F_IS_OPTIONAL	= 0x02,  // optional, ignore at normal operation
    STR_F_IS_SPECIAL	= 0x04,  // special, hard coded for wiimmfi.de
    STR_F_RESTORE_HTTPS	= 0x08,  // restore "https://"
}
__attribute__ ((packed)) str_flags_t;

//-----------------------------------------------------------------------------
// [[str_server_t]]

typedef enum str_server_t
{
    SERV_NONE,		// special case: only 'https'

    SERV_NASW,
    SERV_NASW_DEV,
    SERV_NASW_TEST,
    SERV_MKW_RACE,
    SERV_SAKE,
    SERV_S_SAKE,
    SERV_GS,

    SERV__N

} str_server_t;

//-----------------------------------------------------------------------------
// [[str_server_list_t]]

typedef struct str_server_list_t
{
    str_server_t	serv_type;	// type of server
    ccp			name;		// short identification name
    uint		port;		// redirection port
    uint		domain_len;	// length of domain
    ccp			domain;		// full qualified domain
}
str_server_list_t;

extern const str_server_list_t ServerList[SERV__N+1];

//-----------------------------------------------------------------------------
// [[str_server_patch_t]]

typedef struct str_server_patch_t
{
    str_mode_t		mode;		// language mode
    str_flags_t		flags;		// flags
    u8			is_http;	// 0:neither, 1:http, 2:https
    str_server_t	serv_type;	// server type
    u32			offset;		// file offset of 'https://'
    uint		url_len;	// length of complete URL
    ccp			param;		// param incl. separator
}
str_server_patch_t;

extern const str_server_patch_t ServerPatch[];

//-----------------------------------------------------------------------------
// [[str_status_t]]

typedef enum str_status_t
{
    //--- shift values

    STR_S_SHIFT_ORDER_ALT	= 0,	// alternative order detected
    STR_S_SHIFT_ORDER_MULTI	= 1,	// multiple used elements detected
    STR_S_SHIFT_ORDER_BAD	= 2,	// bad alternatives detected
    STR_S_SHIFT_ORDER_DIFF	= 3,	// different alternatives detected

    //--- concrete values

    STR_S_ANALYZED		= 0x0000001, // data analyzed
    STR_S_WRONG_SIZE		= 0x0000002, // wrong file size
    STR_S_ORIG			= 0x0000004, // original file (checksum ok)
    STR_S_UNKNOWN_PATCH		= 0x0000008, // unknown patches found

    STR_S_TRACK_ORDER		= 0x0000010, // base value for tracks
     STR_S_TRACK_ORDER_ALT	= STR_S_TRACK_ORDER << STR_S_SHIFT_ORDER_ALT,
     STR_S_TRACK_ORDER_MULTI	= STR_S_TRACK_ORDER << STR_S_SHIFT_ORDER_MULTI,
     STR_S_TRACK_ORDER_BAD	= STR_S_TRACK_ORDER << STR_S_SHIFT_ORDER_BAD,
     STR_S_TRACK_ORDER_DIFF	= STR_S_TRACK_ORDER << STR_S_SHIFT_ORDER_DIFF,

    STR_S_ARENA_ORDER		= 0x0000100, // base value for arenas
     STR_S_ARENA_ORDER_ALT	= STR_S_ARENA_ORDER << STR_S_SHIFT_ORDER_ALT,
     STR_S_ARENA_ORDER_MULTI	= STR_S_ARENA_ORDER << STR_S_SHIFT_ORDER_MULTI,
     STR_S_ARENA_ORDER_BAD	= STR_S_ARENA_ORDER << STR_S_SHIFT_ORDER_BAD,
     STR_S_ARENA_ORDER_DIFF	= STR_S_ARENA_ORDER << STR_S_SHIFT_ORDER_DIFF,

    STR_S_CTGP44		= 0x00001000, // CTGP 4.4 modification found
    STR_S_CTGP44_LIKE		= 0x00002000, // CTGP 4.4 like modification found

    STR_S_VS_REGION_KNOWN	= 0x00004000, // known versus region patch found
    STR_S_VS_REGION_KNOWN_DIFF	= 0x00008000, //   "  with different values
    STR_S_VS_REGION_UNKNOWN	= 0x00010000, // unknown versus region patch found

    STR_S_BT_REGION_KNOWN	= 0x00020000, // known battle region patch found
    STR_S_BT_REGION_KNOWN_DIFF	= 0x00040000, //   "  with different values
    STR_S_BT_REGION_UNKNOWN	= 0x00080000, // unknown battle region patch found

    STR_S_ALL_RANKS_KNOWN	= 0x00100000, // known expand-fc patch found
    STR_S_ALL_RANKS_UNKNOWN	= 0x00200000, // expand-fc patch found

    STR_S_VS			= 0x00400000, // 'vs' fields modified
    STR_S_BT			= 0x00800000, // 'bt' fields modified

    STR_S_HTTPS			= 0x01000000, // https strings patched
    STR_S_VERSUS_POINTS		= 0x02000000, // versus points table modified
    STR_S_CANNON		= 0x04000000, // at least 1 cannon patched
    STR_S_MENO			= 0x08000000, // 'Menu' -> 'MenO' patched


    //--- combined values

    STR_S_TRACK_ORDER__FAIL	= STR_S_TRACK_ORDER_MULTI
				| STR_S_TRACK_ORDER_BAD
				| STR_S_TRACK_ORDER_DIFF,

    STR_S_ARENA_ORDER__FAIL	= STR_S_ARENA_ORDER_MULTI
				| STR_S_ARENA_ORDER_BAD
				| STR_S_ARENA_ORDER_DIFF,

} str_status_t;

//-----------------------------------------------------------------------------
// [[dol_status_t]]

typedef enum dol_status_t
{
    DOL_S_ANALYZED		= 0x0001, // data analyzed
    DOL_S_KNOWN			= 0x0002, // seems to be a known main.dol
    DOL_S_ORIG			= 0x0004, // original file (checksum ok)
    DOL_S_CTCODE		= 0x0010, // CT-CODE variant found (checksum ok)
    DOL_S_WIIMMFI		= 0x0020, // wiimmfi patch found (checksum ok)

    DOL_S_HTTPS			= 0x0040, // https strings patched
    DOL_S_VBI			= 0x0080, // VBI patched
    DOL_S_SDKVER		= 0x0100, // sdk version patched
    DOL_S_2HOST			= 0x0200, // second host patched

} dol_status_t;

//-----------------------------------------------------------------------------
// [[dol_info_flags_t]]

typedef enum dol_info_flags_t
{
    DIF_MODE	    = 0x03,	// str_mode_t - 1
    DIF_ORIG	    = 0x04,	// orig image found
    DIF_CTCODE	    = 0x08,	// CT-CODE patched
}
dol_info_flags_t;

//-----------------------------------------------------------------------------
// [[dol_patch_flags_t]]

typedef enum dol_patch_flags_t
{
    DPF_WCODE,
    DPF_CHEAT,
    DPF_ALLOW_USER,
    DPF_CTCODE,
    DPF__N,
}
dol_patch_flags_t;

//-----------------------------------------------------------------------------

#define MAX_REGION_PATCH 5
#define PATCHED_BY_SIZE 42

typedef enum patched_by_t
{
    PBY_OFF,
    PBY_RESET,
    PBY_WIIMMFI,
    PBY_AUTO,
    PBY_ALWAYS,
}
patched_by_t;

extern patched_by_t patched_by_mode;
int ScanOptPBMode ( ccp arg );

//
///////////////////////////////////////////////////////////////////////////////
///////////////			struct staticr_t		///////////////
///////////////////////////////////////////////////////////////////////////////
// [[staticr_t]]

typedef struct staticr_t
{
    //--- base info

    ccp			fname;			// filename of loaded file
    FileAttrib_t	fatt;			// file attribute
    file_format_t	fform;			// file format

    //--- file status

    bool		is_staticr;		// file is a 'StaticR.rel'
    bool		is_dol;			// file is a '*.dol'
    bool		is_main;		// file is a known 'main.dol'
    str_mode_t		mode;			// data mode
    str_status_t	str_status;		// data status (only StaticR)
    dol_status_t	dol_status;		// data status (only DOL files)
    ccp			dol_info;		// NULL or pointer to a dol info
    u32			dol_info_flags;		// info flags for NAS by WCODE
    bool		dol_info_flags_set;	// true, if DOF_ORIG already set
    char		dol_flags[DPF__N+1];	// flags to patch patched_by
    bool		dol_cleaned;		// TRUE if DOL was cleaned

    //--- analyze data

    int			vs_region[MAX_REGION_PATCH];	// found vs regions, -1=orig
    int			bt_region[MAX_REGION_PATCH];	// found bt regions, -1=orig
    u32			vbi_address;			// >0: VBI entry address
    char		patched_by[PATCHED_BY_SIZE+1];	// patched by version
    char		sdk_version[9];			// patched value of 'sdkver'
    u8			cannon_data[48];		// copied cannon data

    //--- raw data

    u8			* data;			// raw data
    uint		data_size;		// size of 'data'
    bool		data_alloced;		// true: 'data' must be freed

} staticr_t;

//
///////////////////////////////////////////////////////////////////////////////
///////////////			    interface			///////////////
///////////////////////////////////////////////////////////////////////////////

void InitializeSTR ( staticr_t * str );
void ResetSTR ( staticr_t * str );

enumError LoadSTR
(
    staticr_t		* str,		// valid pointer
    bool		initialize,	// true: initialize 'str'
    ccp			fname,		// filename of source
    bool		ignore_no_file	// ignore if file does not exists
					// and return warning ERR_NOT_EXISTS
);

void AnalyzeSTR
(
    staticr_t		* str		// valid pointer
);

void PrintStatusSTR
(
    FILE		* f,		// destination file
    int			indent,		// indention
    staticr_t		* str,		// valid pointer
    int			long_mode	// >0: print more track details if changed
);

uint PatchSTR
(
    // returns: number of patches

    staticr_t		* str		// valid pointer
);

enumError DumpSTR
(
    FILE		* f,		// dump to this file
    int			indent,		// indention
    staticr_t		* str,		// valid pointer
    bool		use_c		// true: print in C language fragments
);

enumError ExtractSTR
(
    staticr_t		* str,		// valid pointer
    ccp			dest_dir	// valid destination directory
);

///////////////////////////////////////////////////////////////////////////////

const u32 * GetTrackOffsetTab  ( str_mode_t mode );
const u32 * GetArenaOffsetTab  ( str_mode_t mode );

///////////////////////////////////////////////////////////////////////////////
// [[VersusPointsInfo_t]]

typedef struct VersusPointsInfo_t
{
    u8		region_mode;	// related mode, type str_mode_t
    char	region_code;	// region code: E|P|J|K
    u32		off_staticr;	// offset witing StaticR.rel
    u32		cheat_base;	// offset for the cheat code
}
VersusPointsInfo_t;

extern const VersusPointsInfo_t VersusPointsInfo[STR_M__N];
extern str_mode_t opt_cheat_region;

static inline const VersusPointsInfo_t * GetVersusPointsInfo ( str_mode_t mode )
	{ return VersusPointsInfo + ( mode < STR_M__N ? mode : STR_M_UNKNOWN ); }

uint GetVersusPointsOffset ( str_mode_t mode );
int ScanOptCheatRegion ( ccp arg );

//
///////////////////////////////////////////////////////////////////////////////
///////////////			    rel file format		///////////////
///////////////////////////////////////////////////////////////////////////////
// [[rel_header_t]]

typedef struct rel_header_t
{
  /*00*/  u32	id;		// Arbitrary identification number for game use.
  /*04*/  u32	unknown_04;	// padding? ignored by MKW
  /*08*/  u32	unknown_08;	// padding? ignored by MKW
  /*0c*/  u32	n_section;	// Number of sections in the file.
  /*10*/  u32	section_off;	// Offset to the start of the section table.
  /*14*/  u32	mod_name;	// NULL or Offset to ASCII string containing name of module.
  /*18*/  u32	mod_name_len;	// Length of 'mod_name' name in bytes.
  /*1c*/  u32	version;	// Version number of the REL file format.
  /*20*/  u32	bss_size;	// Size of the 'bss' section.
  /*24*/  u32	reloc_off;	// Offset to the relocation table.
  /*28*/  u32	imp_off;	// Offset to imp(?).
  /*2c*/  u32	imp_size;	// Size of imp(?).
  /*30*/  u32	flags;		// flags of some sort? ignored by MKW
  /*34*/  u32	prolog;		// ?
  /*38*/  u32	epilog;		// ?
  /*3c*/  u32	unknown_3c;	// unresolved: ?
  /*40*/  u32	align_all;	// Version e 2: Alignment constraint on all sections.
  /*44*/  u32	align_bss;	// Version e 2: Alignment constraint on all 'bss' sections.
  /*48*/  u32	fix_size;	// Version e 3: fixSize

}
__attribute__ ((packed)) rel_header_t;


///////////////////////////////////////////////////////////////////////////////
// [[rel_sect_info_t]]

typedef struct rel_sect_info_t
{
    u32		offset;		// Location in file of the section information.
				//   The last bit determines if this section is
				//   executable or not. If offset is zero,
				//   the section is an uninitialized section.
    u32		size;		// size of of the section
}
__attribute__ ((packed)) rel_sect_info_t;

///////////////////////////////////////////////////////////////////////////////
// [[rel_imp_t]]

typedef struct rel_imp_t
{
    u32		type;		// Type of the relocation entries:
				//   1 for internal, 0 for external.
    u32		offset;		// Offset from the beginning of the REL
				//   to the relocatino data.
}
__attribute__ ((packed)) rel_imp_t;

///////////////////////////////////////////////////////////////////////////////
// [[rel_data_t]]

