
/***************************************************************************
 *                         _______ _______ _______                         *
 *                        |  ___  |____   |  ___  |                        *
 *                        | |   |_|    / /| |   |_|                        *
 *                        | |_____    / / | |_____                         *
 *                        |_____  |  / /  |_____  |                        *
 *                         _    | | / /    _    | |                        *
 *                        | |___| |/ /____| |___| |                        *
 *                        |_______|_______|_______|                        *
 *                                                                         *
 *                            Wiimms SZS Tools                             *
 *                          https://szs.wiimm.de/                          *
 *                                                                         *
 ***************************************************************************
 *                                                                         *
 *   This file is part of the SZS project.                                 *
 *   Visit https://szs.wiimm.de/ for project details and sources.          *
 *                                                                         *
 *   Copyright (c) 2011-2023 by Dirk Clemens <wiimm@wiimm.de>              *

///////////////////////////////////////////////////////////////////////////////

typedef enum kmp_ac_mode
{
    //--- modes

    KMP_AC_OFF		= 0,		// don't auto connect, always 0
    KMP_AC_PREV,			// auto connect PREV by NEXT always
    KMP_AC_AUTO_PREV,			// auto connect PREV by NEXT if $PREV not used
    KMP_AC_DISPATCH,			// auto connect for arenas, mode DISPATCH
     KMP_AC_MASK	= 0x0f,		// mask for modes

    //--- flags/options

    KMP_ACF_FIX_PREV	= 0x10,		// fix prev links
    KMP_ACF_FIX_NEXT	= 0x20,		// fix next links
    KMP_ACF_FIX		= KMP_ACF_FIX_PREV | KMP_ACF_FIX_NEXT,
    KMP_ACF_PR_PREV	= 0x40,		// print $PREV:...
     KMP_ACF_MASK	= 0x70,		// mask for flags
}
__attribute__ ((packed)) kmp_ac_mode;

//-----------------------------------------------------------------------------
// [[kmp_class_mode]]

typedef enum kmp_class_mode
{
    KCLS_OFF = 0,	// don't connect
    KCLS_ANY,		// allow any class except KCLS_OFF
    KCLS_DEFAULT,	// default class
    KCLS_USER,		// first user defined name
}
__attribute__ ((packed)) kmp_class_mode;

//-----------------------------------------------------------------------------
// [[kmp_oneway_mode]]

typedef enum kmp_oneway_mode
{
    ONEWAY_NONE = 0,	// one-way is off
    ONEWAY_PREV = 1,	// one-way only for prev links
    ONEWAY_NEXT = 2,	// one-way only for next links
    ONEWAY_BOTH = 3,	// one-way for prev and next links
}
__attribute__ ((packed)) kmp_oneway_mode;

extern const KeywordTab_t kmp_oneway_name[];

//
///////////////////////////////////////////////////////////////////////////////
///////////////			enum kmp_entry_t		///////////////
///////////////////////////////////////////////////////////////////////////////
// [[kmp_entry_t]]

typedef enum kmp_entry_t
{
    KMP_KTPT,	//	Starting positions of racers
    KMP_ENPT,	//	Enemy route points
    KMP_ENPH,	//	Enemy route points header: Divide enemy points into groups
    KMP_ITPT,	//	Item route points
    KMP_ITPH,	//	Item points header: Divide item points into groups
    KMP_CKPT,	//	Check points
    KMP_CKPH,	//	Checkpoint header: Divide checkpoints into groups
    KMP_GOBJ,	// 'O',	Global objects
    KMP_POTI,	// 'R',	Routes
    KMP_AREA,	// 'A',	Camera and other areas
    KMP_CAME,	// 'C',	Cameras
    KMP_JGPT,	// 'J',	Respawn positions
    KMP_CNPT,	// 'N',	Cannon target positions
    KMP_MSPT,	// 'M',	End battle positions
    KMP_STGI,	// 'S',	Stage information

    KMP_N_SECT,		// number of regular KMP sections

    KMP_WIM0,		// extra section to export binary data (bzip2)
    KMP_NN_SECT,	// number of all KMP sections

    KMP_NO_SECT		// value for invalid section types

} kmp_entry_t;

extern const uint kmp_entry_size[KMP_N_SECT+1];
extern const KeywordTab_t kmp_section_name[];

//
///////////////////////////////////////////////////////////////////////////////
///////////////			kmp_file_*_t			///////////////
///////////////////////////////////////////////////////////////////////////////
// [[kmp_file_gen_t]] generic KMP file header

typedef struct kmp_file_gen_t
{
  /*0x00*/  char	magic[4];	// always KMP_MAGIC = "RKMD"
  /*0x04*/  u32		file_size;	// size of file
  /*0x08*/  u16		n_sect;		// number of sections
  /*0x0a*/  u16		head_size;	// header size, usually 0x4c
  /*0x0c*/  u32		version;	// KMP version number

  /*0x10*/  u32		sect_off[0];	// offsets of all sections,
					// relative to 'head_size'
}
__attribute__ ((packed)) kmp_file_gen_t;

static inline uint GetFileHeadSizeKMP ( uint n_sect )
	{ return sizeof(kmp_file_gen_t) + n_sect * sizeof(u32); }

///////////////////////////////////////////////////////////////////////////////
// [[kmp_file_mkw_t]] KMP file header as MKWii template

typedef struct kmp_file_mkw_t
{
  /*0x00*/  char	magic[4];	// always KMP_MAGIC = "RKMD"
  /*0x04*/  u32		file_size;	// size of file
  /*0x08*/  u16		n_sect;		// number of sections
  /*0x0a*/  u16		head_size;	// header size, usually 0x4c
  /*0x0c*/  u32		version;	// KMP version number

  /*0x10*/  u32		sect_off[KMP_N_SECT];
					// offsets of all sections,
					// relative to 'head_size'
  /*0x4c*/
}
__attribute__ ((packed)) kmp_file_mkw_t;

///////////////////////////////////////////////////////////////////////////////
// [[kmp_file_wim0_t]] KMP file header as MKWii template with WIM= section

typedef struct kmp_file_wim0_t
{
  /*0x00*/  char	magic[4];	// always KMP_MAGIC = "RKMD"
  /*0x04*/  u32		file_size;	// size of file
  /*0x08*/  u16		n_sect;		// number of sections
  /*0x0a*/  u16		head_size;	// header size, usually 0x4c
  /*0x0c*/  u32		version;	// KMP version number

  /*0x10*/  u32		sect_off[KMP_N_SECT+1];
					// offsets of all sections,
					// relative to 'head_size'
  /*0x50*/
}
__attribute__ ((packed)) kmp_file_wim0_t;

///////////////////////////////////////////////////////////////////////////////
// [[kmp_head_info_t]]

typedef struct kmp_head_info_t
{
    const u8		* data;		// data to scan
    const u8		* end;		// end of data
    uint		data_size;	// size of 'data'

    uint		file_size;	// size declared in header
    uint		max_size;	// := min(data_size,file_size)
    uint		head_size;	// size of header
    uint		max_off;	// max usable offset (end-4)
    int			n_sect;		// number of section, 0 on error
    u32			*sect_off;	// list mit section offsets
}
kmp_head_info_t;

void ScanHeadInfoKMP ( kmp_head_info_t *hi, cvp data, uint data_size );

//
///////////////////////////////////////////////////////////////////////////////
///////////////			kmp list & entries		///////////////
///////////////////////////////////////////////////////////////////////////////
// [[kmp_list_head_t]]

typedef struct kmp_list_head_t
{
  /*0x00*/  char	magic[4];	// related string
  /*0x04*/  u16		n_entry;	// number of entries
  /*0x06*/  u16		value;		// addititional value
					//   POTI: total number of points

  /*0x08*/  u8		entry[0];	// entries
}
__attribute__ ((packed)) kmp_list_head_t;

///////////////////////////////////////////////////////////////////////////////
// [[kmp_ktpt_entry_t]]

typedef struct kmp_ktpt_entry_t
{
  // Kart Points: Starting positions of racers.

  /*0x00*/  float32	position[3];	// start position
  /*0x0c*/  float32	rotation[3];	// start rotation
  /*0x18*/  s16		player_index;	// index or -1 for all players
  /*0x1a*/  u16		unknown;	// padding?
  /*0x1c*/
}
__attribute__ ((packed)) kmp_ktpt_entry_t;

///////////////////////////////////////////////////////////////////////////////
// [[kmp_enpt_entry_t]]  [[kmp_itpt_entry_t]]

typedef struct kmp_enpt_entry_t
{
  // Enemy Points: Routes of the cpu racers

  /*0x00*/  float32	position[3];	// start position
  /*0x0c*/  float32	scale;
  /*0x10*/  u16		prop[2];	// point properties
  /*0x14*/
}
__attribute__ ((packed)) kmp_enpt_entry_t;

// [[kmp_itpt_entry_t]]  Item Points: Routes of red shells and bullet bill
typedef kmp_enpt_entry_t kmp_itpt_entry_t;

///////////////////////////////////////////////////////////////////////////////
// [[kmp_enph_entry_t]]

typedef struct kmp_enph_entry_t
{
  // Enemy Points grouping: Route links of cpu racers

  /*0x00*/  u8		pt_start;
  /*0x01*/  u8		pt_len;
  /*0x02*/  u8		prev[KMP_MAX_PH_LINK];
  /*0x08*/  u8		next[KMP_MAX_PH_LINK];
  /*0x0e*/  u8		setting[2];		// only used for arena ENPT
  /*0x10*/
}
__attribute__ ((packed)) kmp_enph_entry_t;

// [[kmp_itph_entry_t]]  Item Points grouping: Route links of cpu racers
typedef kmp_enph_entry_t kmp_itph_entry_t;

// [[kmp_ckph_entry_t]]  Check point links
typedef kmp_enph_entry_t kmp_ckph_entry_t;

///////////////////////////////////////////////////////////////////////////////
// [[kmp_ckpt_entry_t]]

typedef struct kmp_ckpt_entry_t
{
  // Check Points

  /*0x00*/  float32	left[2];	// left hand position of checkpoint line
  /*0x08*/  float32	right[2];	// right hand position of checkpoint line
  /*0x10*/  u8		respawn;	// index into JGPT section
  /*0x11*/  u8		mode;		// 0:lap counter, -1:other, *:must cross
  /*0x12*/  u8		prev;		// previous checkpoint in sequence
  /*0x13*/  u8		next;		// next checkpoint in sequence
  /*0x14*/
}
__attribute__ ((packed)) kmp_ckpt_entry_t;

///////////////////////////////////////////////////////////////////////////////
// [[kmp_gobj_entry_t]]

typedef struct kmp_gobj_entry_t
{
  // Global objects

  /*0x00*/  u16		obj_id;		// object id
  /*0x02*/  u16		ref_id;		// reference id, padding in original MKWii
  /*0x04*/  float32	position[3];
  /*0x10*/  float32	rotation[3];
  /*0x1c*/  float32	scale[3];
  /*0x28*/  u16		route_id;
  /*0x2a*/  u16		setting[8];	// object setting
  /*0x3a*/  u16		pflags;		// presence flags
  /*0x3c*/
}
__attribute__ ((packed)) kmp_gobj_entry_t;

///////////////////////////////////////////////////////////////////////////////
// [[kmp_poti_group_t]]

typedef struct kmp_poti_group_t
{
  // Routes

  /*0x00*/  u16		n_point;	// number of related points
  /*0x02*/  u8		smooth;		// 1: enable smooth moving
  /*0x03*/  u8		back;		// 1: enable forward+backward
  /*0x04*/
}
__attribute__ ((packed)) kmp_poti_group_t;

//-----------------------------------------------------------------------------
// [[kmp_poti_point_t]]

typedef struct kmp_poti_point_t
{ 
  // Routes

  /*0x00*/  float32	position[3];
  /*0x0c*/  u16		speed;		// speed in 60pt/s
  /*0x0e*/  u16		unknown;	// Nintendo: 0 (~94%), 1,2,3,4,5,6,9,12
  /*0x10*/
}
__attribute__ ((packed)) kmp_poti_point_t;

///////////////////////////////////////////////////////////////////////////////
// [[kmp_area_entry_t]]

typedef struct kmp_area_entry_t
{
  // Camera and other areas

  /*0x00*/  u8		mode;		// mode of area
  /*0x01*/  u8		type;		// type of area
  /*0x02*/  u8		dest_id;	// index into CAME
  /*0x03*/  u8		prio;		// higher number => higher priority
  /*0x04*/  float32	position[3];
  /*0x10*/  float32	rotation[3];
  /*0x1c*/  float32	scale[3];
  /*0x28*/  u16		setting[2];
  /*0x2c*/  u8		route;
  /*0x2d*/  u8		enemy;
  /*0x2e*/  u16		unknown_2e;
  /*0x30*/
}
__attribute__ ((packed)) kmp_area_entry_t;

///////////////////////////////////////////////////////////////////////////////
// [[kmp_came_entry_t]]

typedef struct kmp_came_entry_t
{
  // Cameras

  /*0x00*/  u8		type;		// type of camera
  /*0x01*/  u8		next;		// next camera
  /*0x02*/  u8		unknown_0x02;
  /*0x03*/  u8		route;		// route index -> POTI
  /*0x04*/  u16		came_speed;	// unsure!
  /*0x06*/  u16		zoom_speed;	// zoom speed in units per 100/60 sec
  /*0x08*/  u16		viewpt_speed;	// view point speed in units per 100/60 sec
  /*0x0a*/  u16		unknown_0x0a;
  /*0x0c*/  float32	position[3];	// camera position
  /*0x18*/  float32	rotation[3];	// rotation? (always 0)
  /*0x24*/  float32	zoom_begin;	// zoom value begin
  /*0x28*/  float32	zoom_end;	// zoom value end
  /*0x2c*/  float32	viewpt_begin[3];// view point begin
  /*0x38*/  float32	viewpt_end[3];	// view point end
  /*0x44*/  float32	time;		// active time of the camera
  /*0x48*/
}
__attribute__ ((packed)) kmp_came_entry_t;

///////////////////////////////////////////////////////////////////////////////
// [[kmp_jgpt_entry_t]]

typedef struct kmp_jgpt_entry_t
{
  // Jugem points: Respawn positions

  /*0x00*/  float32	position[3];
  /*0x0c*/  float32	rotation[3];
  /*0x18*/  s16		id;
  /*0x1a*/  u16		effect;
  /*0x1c*/
}
__attribute__ ((packed)) kmp_jgpt_entry_t;

// [[kmp_cnpt_entry_t]]  Cannon Points: Cannon target positions
typedef kmp_jgpt_entry_t kmp_cnpt_entry_t;

// [[kmp_mspt_entry_t]]
// After battles and competitions have ended the players are placed on this point(s)
typedef kmp_jgpt_entry_t kmp_mspt_entry_t;

///////////////////////////////////////////////////////////////////////////////
// [[kmp_stgi_entry_t]]

typedef struct kmp_stgi_entry_t
{
  //  Stage Information

  /*0x00*/  u8		lap_count;		// XML suggest, used by lap_modifier
  /*0x01*/  u8		pole_pos;		// 0:left, 1:right
  /*0x02*/  u8		narrow_start;		// 0:normal, 1:closer together
  /*0x03*/  u8		enable_lens_flare;	// 0:off, 1:enabled
  /*0x04*/  u32		flare_color;		// 0xe6e6e6 or 0xffffff
  /*0x08*/  u8		flare_alpha;		// alpha channel (transparency)
  /*0x09*/  u8		unknown_09;		// always 0
  /*0x0a*/  u16		speed_mod;		// nintendo: always 0
						// custom: MSB of speed modifier
  /*0x0c*/
}
__attribute__ ((packed)) kmp_stgi_entry_t;

//
///////////////////////////////////////////////////////////////////////////////
///////////////			KMP sort modes			///////////////
///////////////////////////////////////////////////////////////////////////////
// [[kmp_sort_t]]

typedef enum kmp_sort_t
{
    KSORT_OFF,		// don't sort
    KSORT_GROUP,	// sort by groups
    KSORT_ANGLE,	// sort by groups and angles
    KSORT_XYZ,		// sort by groups and coordonates in xyz order
    KSORT_TINY,		// sort for TINY
}
kmp_sort_t;

//
///////////////////////////////////////////////////////////////////////////////
///////////////			Wim0 support			///////////////
///////////////////////////////////////////////////////////////////////////////
// [[kmp_wim0_sect_id]]

typedef enum kmp_wim0_sect_id
{
    W0ID_END		= 0,
    W0ID_VERSION	= 'V' << 8 | 'e',
//    W0ID_AUTO_CONNECT	= 'A' << 8 | 'C',
}
