
/***************************************************************************
 *                         _______ _______ _______                         *
 *                        |  ___  |____   |  ___  |                        *
 *                        | |   |_|    / /| |   |_|                        *
 *                        | |_____    / / | |_____                         *
 *                        |_____  |  / /  |_____  |                        *
 *                         _    | | / /    _    | |                        *
 *                        | |___| |/ /____| |___| |                        *
 *                        |_______|_______|_______|                        *
 *                                                                         *
 *                            Wiimms SZS Tools                             *
 *                          https://szs.wiimm.de/                          *
 *                                                                         *
 ***************************************************************************
 *                                                                         *
 *   This file is part of the SZS project.                                 *
 *   Visit https://szs.wiimm.de/ for project details and sources.          *
 *                                                                         *
 *   Copyright (c) 2011-2020 by Dirk Clemens <wiimm@wiimm.de>              *
 *                                                                         *
 ***************************************************************************
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   See file gpl-2.0.txt or http://www.gnu.org/licenses/gpl-2.0.txt       *
 *                                                                         *
 ***************************************************************************/

///////////////////////////////////////////////////////////////////////////////

#ifndef SZS_LIB_KCL_H
#define SZS_LIB_KCL_H 1

#include "lib-std.h"
#include "db-kcl.h"
#include "lib-image.h"

//
///////////////////////////////////////////////////////////////////////////////
///////////////			definitions			///////////////
///////////////////////////////////////////////////////////////////////////////

#ifdef TEST // [[cube]]
  #define SUPPORT_KCL_CUBE	1
  #define SUPPORT_KCL_XTRIDATA	0   // 0=off, 1=extra
  #define SUPPORT_KCL_DELTA	0   // 0|1
#else
  #define SUPPORT_KCL_CUBE	0
  #define SUPPORT_KCL_XTRIDATA	0
  #define SUPPORT_KCL_DELTA	0
#endif

///////////////////////////////////////////////////////////////////////////////

#define KCL_TEXT_MAGIC		"#KCL"
#define KCL_TEXT_MAGIC_NUM	0x234b434c

#define KCL_SIGNATURE		"WiimmSZS"

#define KCL_MTL_EXT		".mtl"
#define KCL_FLAG_FILE1		"\1P/\1N\1T"
#define KCL_FLAG_FILE2		"\1P/\1F\1T"
#define KCL_FLAG_EXT		".flag"

#define N_KCL_SECT		4

///////////////////////////////////////////////////////////////////////////////
///////////////			kcl_analyze_t			///////////////
///////////////////////////////////////////////////////////////////////////////
// [[kcl_analyze_t]]

typedef struct kcl_analyze_t
{
    valid_t	valid;			// valid status
    u16		order_value;		// digits 1, 2, 3, 4 as dec to reflect order
    bool	order_ok;		// true: regular order (order_value==1234)
    u32		head_size;		// size of head
    u32		file_size;		// not NULL: size of file
    u32		off[N_KCL_SECT];	// offsets of KCL sections
    u32		size[N_KCL_SECT];	// max size of KCL sections (U32_MAX=unknown)
    u32		n[N_KCL_SECT];		// number of KCL entries based on 'size'
}
kcl_analyze_t;

ccp GetValidInfoKCL ( kcl_analyze_t * ka );

//
///////////////////////////////////////////////////////////////////////////////
///////////////			kcl_head_t			///////////////
///////////////////////////////////////////////////////////////////////////////

typedef struct kcl_head_t
{
  /*0x00*/  u32		sect_off[N_KCL_SECT];	// offset of the 4 sections
  /*0x10*/  float32	unknown_0x10;
  /*0x14*/  float32	min_octree[3];		// minimum values
  /*0x20*/  u32		mask[3];		// masks for spatial index
  /*0x2c*/  u32		coord_rshift;		// right shift for all coord
  /*0x30*/  u32		y_lshift;		// left shift for y values
  /*0x34*/  u32		z_lshift;		// left shift for z values
  /*0x38*/  float32	unknown_0x38;
  /*0x3c*/
}
__attribute__ ((packed)) kcl_head_t;

//
///////////////////////////////////////////////////////////////////////////////
///////////////			kcl_triangle_t			///////////////
///////////////////////////////////////////////////////////////////////////////

typedef struct kcl_triangle_t
{
  /*0x00*/  float32	length;			//
  /*0x04*/  u16		idx_vertex;		//
  /*0x06*/  u16		idx_normal[4];		//
  /*0x0e*/  u16		flag;			// KCL flag (includes the type)
  /*0x10*/
}
__attribute__ ((packed)) kcl_triangle_t;

//
///////////////////////////////////////////////////////////////////////////////
///////////////			kcl_tridata_status_t		///////////////
///////////////////////////////////////////////////////////////////////////////
// [[kcl_tridata_status_t]]

typedef enum kcl_tridata_status_t
{
    TD_INVALID_NORM	= 0x01,		// 'length' & 'normal' are invalid
    TD_INVALID		= 0x02,		// invalid data
    TD_FIXED_PT		= 0x04,		// triangle was fixed/repaired
    TD_UNUSED		= 0x08,		// triangle not used in octree
    TD_REMOVED		= 0x10,		// triangle is marked as 'removed'
    TD_ADDED		= 0x20,		// triangle was added
    TD_MARK		= 0x40,		// temporary marker for calculations

    TDX_ORIG_PT		= 0x1000,	// original 'pt' valid
    TDX_ORIG_NORM	= 0x2000,	// original 'length' & 'normal' valid

} kcl_tridata_status_t;

//
